# Pandas

## Indexing and Selection

In [1]:
import pandas as pd

In [2]:
frame = pd.read_csv('data-sample-example.tsv', sep='\t', header=0)

In [3]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [4]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [5]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [6]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [7]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [8]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 272.0+ bytes

In [9]:
frame.fillna('разработчик', inplace=True)
frame

              Name      Birth       City     Position
0      Иванов А.А. 1980-03-22     Москва  разработчик
1     Сорокин И.В. 1965-07-08  Волгоград      инженер
2       Белов М.М. 1980-02-13     Ростов     менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разработчик
4      Рыбина Е.П. 1985-11-19     Москва      инженер
5     Костров С.О. 1985-05-31     Москва       стажер

In [10]:
frame.Position

0    разработчик
1        инженер
2       менеджер
3    разработчик
4        инженер
5         стажер
Name: Position, dtype: object

In [11]:
frame[['Position']]

      Position
0  разработчик
1      инженер
2     менеджер
3  разработчик
4      инженер
5       стажер

In [12]:
frame[['Name', 'Position']]

              Name     Position
0      Иванов А.А.  разработчик
1     Сорокин И.В.      инженер
2       Белов М.М.     менеджер
3  Мельникова Д.С.  разработчик
4      Рыбина Е.П.      инженер
5     Костров С.О.       стажер

In [13]:
frame.head()

              Name      Birth       City     Position
0      Иванов А.А. 1980-03-22     Москва  разработчик
1     Сорокин И.В. 1965-07-08  Волгоград      инженер
2       Белов М.М. 1980-02-13     Ростов     менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разработчик
4      Рыбина Е.П. 1985-11-19     Москва      инженер

In [14]:
frame[:3]

           Name      Birth       City     Position
0   Иванов А.А. 1980-03-22     Москва  разработчик
1  Сорокин И.В. 1965-07-08  Волгоград      инженер
2    Белов М.М. 1980-02-13     Ростов     менеджер

In [15]:
frame[-3:]

              Name      Birth    City     Position
3  Мельникова Д.С. 1985-04-15  Ростов  разработчик
4      Рыбина Е.П. 1985-11-19  Москва      инженер
5     Костров С.О. 1985-05-31  Москва       стажер

In [16]:
frame.loc[[1, 3, 5], ['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [17]:
frame.iloc[[1, 3, 5], [0, 2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [18]:
frame.ix[[1, 3, 5], ['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [19]:
frame.ix[[1, 3, 5], [0, 2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [20]:
frame[frame.Birth >= pd.datetime(1985, 1, 1)]

              Name      Birth    City     Position
3  Мельникова Д.С. 1985-04-15  Ростов  разработчик
4      Рыбина Е.П. 1985-11-19  Москва      инженер
5     Костров С.О. 1985-05-31  Москва       стажер

In [21]:
frame[frame.City == 'Москва']

           Name      Birth    City     Position
0   Иванов А.А. 1980-03-22  Москва  разработчик
4   Рыбина Е.П. 1985-11-19  Москва      инженер
5  Костров С.О. 1985-05-31  Москва       стажер

In [24]:
frame[(frame.Birth >= pd.datetime(1985, 1, 1)) & (frame.City == 'Москва')]

           Name      Birth    City Position
4   Рыбина Е.П. 1985-11-19  Москва  инженер
5  Костров С.О. 1985-05-31  Москва   стажер

In [27]:
frame[(frame.Birth >= pd.datetime(1985, 1, 1)) | (frame.City == 'Ростов')]

              Name      Birth    City     Position
2       Белов М.М. 1980-02-13  Ростов     менеджер
3  Мельникова Д.С. 1985-04-15  Ростов  разработчик
4      Рыбина Е.П. 1985-11-19  Москва      инженер
5     Костров С.О. 1985-05-31  Москва       стажер